################################################################################
# Задание 2:
    # Создайте input() который принимает от пользователя дату в формате: "2020-10-24 18:30" и возвращает dictionary разделённую по значениям даты:
    # date = {
    # "year": "2020",
    # "month": "10",
    # .....
    # }



# today = input('Введите дату: ')
# t = today.split('-')
# h = today.split(':')
# todate = {
#     'year': t[0],
#     'month': t[1],
#     'day' : t[2],
#     'hour': t[3],
#     'minutes': t[4]
# }
# print(t)
# print(todate)


################################################################################
################################################################################
# Задание 3:
    # Вам дан SET значений:
    # uniques = {3,13,15,27,1,4,8,23,19,12,9,2,17}
    # Создайте функцию которая:
        # Удалит все чётные значения внутри SET, а оставшиеся отсортирует по убыванию.
    # В результате, ваша функция должна вернуть отсортированный SET и неважно, каким будет SET растопленным или замороженным.

# uniques = {3,13,15,27,1,4,8,23,19,12,9,2,17}

 
# out = []
 
# for i in range(len(uniques)):
#     if not i % 2 and uniques[i] % 2:
#         out.append(uniques[i])
 
# print(out)
# print(uniques)


################################################################################

 
# today = input('Введите дату: ')
# t = today.split('-')
# todate = {
#     'year': t[0],
#     'month': t[1],
#     'day' : t[2]
#     # 'hour': today.hour,
#     # 'minutes': today.minutes
# }
# print(t)
# print(todate)
# # print('{}-{}-{} '.format(year, month, day))


# ==================================================

# today = input('Введите дату: ')
# t = today.split('-')
# h = today.split(':')
# todate = {
#     'year': t[0],
#     'month': t[1],
#     'day' : t[2],
#     'hour': t[3],
#     'minutes': t[4]
# }
# print(t)
# print(todate)


################################################################################
# Задание 4:
#     Дано список 
#     nums = [137, 168, 100, 90, 60, 500]
#     Найти максимум из списка
#     Решение должно производится с помощью цикла while  
#################################################################################

nums = [137, 168, 100, 90, 60, 500]
nums.sort()
print(nums)

# a = 0
# mx = nums()
# while a len(nums()):
#     if < nums[a]
#     print(mx)