# # Money transfer
# # print('Бугун кайсыл кун?: ')

# # day = int(input())

# # mon = 1 
# # tue = 2
# # wed = 3
# # thu = 4
# # fri = 5
# # sat = 6
# # sun = 7

# # if day == mon:
# #     print('Бугун', mon , '-кун, акчакоторсо болот')
# # if day == tue:
# #     print('Бугун', tue , '-кун, акчакоторсо болот')
# # if day == wed:
# #     print('Бугун', wed , '-кун, акчакоторсо болот')
# # if day == thu:
# #     print('Бугун', tue , '-кун, акчакоторсо болот')
# # if day == thu:
# #     print('Бугун', tue , '-кун, акчакоторсо болот')
# # if day == fri:
# #     print('Бугун', fri , '-кун, акчакоторсо болот')
# # if day == sat:
# #     print('Бугун', sat , '-кун, акчакоторсо болот, бирок тушко чейин эле')
# # if day == sun:
# #     print('Бугун', sun , '-кун, акча которгонго болбойт, банк иштебейт')
    

# # ########### БАНК ИШТОО ГРАФИГИ ##########################3

# print('Банктан акча которуу')
# day = int(input('Бугун канчанчы кун?'))

# if day < 6 and day >=1:
#     print('Банк иштейт акча которсо болот.')
    
# elif day == 6:
#     print('Короткий день')

# elif day == 7:
#     print('иштебейт')

# else:
#     print('Иштебейт.')


# day = int(input('Кунду сан менен тер мен жазуу турундо жазып чыгарам'))

# if day == 1:
#     print('Сегодня, понедельник')
# elif day == 2:
#     print('вторник')

# elif day == 3:
#     print('среда')

##########

# print('А давайте проверим надежность Вашего пароля!')
# password = input('Введите пароль: ')

# if len(password) < 6:
#     print('Слишком слабый пароль')
    
# elif len(password) < 10:
#     print('Пароль не надежный')
    
# else:
#     print('Надежный пароль')
    

