# Курс валют

# Мен сом турундо акчаны берсем валюта боюнча
# конвертация кылып бер.
# Мисалы: 60 000 сомду доллар кылып бер
# 78 685 сомду Евро кылып бер
# 50 000 сомду Тенге кылып бер
# 45 000 сомду Рубль кылып бер

curs = {
    "EUR": 101.65,
    "USD": 84.80,
    "RUS": 1.23,
    "KZT": 0.010
}

valuta = input('Кайсыл валютага которосуз?: ')
valuta = valuta.upper()
money = int(input('Канча акча алмаштырасыз?: '))

if curs.get(valuta) != None:
    print("Сиздин", money, 'сомунуз', money / curs[valuta], valuta, 'болот')
else:
    print('Андай валюта жок!')
    
