
# Задача 1:
  # Спросите у пользователя название любого файла с любым расширением.
  # Попробуйте определить с какое расширение у файла.

#!/usr/bin/python3

# z = input('Введите имя файла: ') 



# if '.' in z:
#       y = z.index('.')
#       print('Расширение вашего файла', z[y+1:])
# else:
#       print('Расширение не найдено')


# #########################################

# Задача 3.
# word = ''
# symbol = ''
# Спросите у пользователя любое слово и запишите в word
# Потом еще раз спросите любой символ из кириллицы и запишите его в symbol
# Вычислите сколько раз встречается symbol в слове word
# Решите задачу с помощью цикла
    # Например:
    # Ввод:  word = 'Государтсво'
    # Ввод:  symbol = 'о'
    
word = input('Введите слово: ')
symbol = input('Какую букву найти?: ')
colich = symb.len()
print('На вашем слово буква', symbol, 'встречается', colich, 'раз')