
# 1. Найти сумму ряда чисел от 1 до 100. Полученный результат вывести на экран; Например, 0+1+2+3+…+100

# for i in range(101):
#     print(i )

# 2. Найти все число делящееся на 7 без остатка из ряда чисел от 7 до 457 и вывести на экран
# 2


    
# 3. Дан список(Lists): 
# numbers = [67, 99, 56, 43, 66, 12]
# Посчитать сумму чисел из списка numbers


# 4. Дан список(Lists): 
# numbersOff = [548, -23, 34, -77, 0, 12, -5, 36, -34, -60, 3, -9]
# Посчитать сумму только отрицательных чисел из списка numbersOff


# 5. Вывести на экран все чётные значения в диапазоне от 1 до 100;


# 6. Вывести на экран все нечётные значения в диапазоне от 1 до 100;


# 7. Перемножить все не чётные значения в диапазоне от 0 до 943


# 8. Записать в список(Lists) все числа в диапазоне от 10 до 2500 кратные;