# Problem0

print('Привет Мир!')
print('Python - язык программирования')
print('Visual Studio Code - редактор кода')

# Problem1
print(11 * 2 ** 2 - 13 / 4 + 7)
# Получаем число 47,75

# Problem2
print(4 ** 4 ** 4)
# Получаем число 13407807929942597099574024998205846127479365820592393377723561443721764030073546976801874298166903427690031858186486050853753882811946569946433649006084096

# Problem3
print(33>32)
print(4>=2)
print(2==2)
# В пункте в кроется ошибка ==

# Problem4
name = input('Введите свое имя: ')
print('Привет, ' + name + '!')

# Problem8
print("a" + " b " * 10)  
# answer a b  b  b  b  b  b  b  b  b  b 


# Problem10
num1 = input('Введите число1: ')
num2 = input('Введите число2: ')
print (num1 == num2)