from tkinter import *
from random import randint

root = Tk()
root.title('Чай-пай генератор')
root.geometry('400x400')


mesto = {
    'Дарханга',
    'Манас-Атага',
    'Палван атага',
    'Караванга',
    'копчулук эмне десе ошол жакка',
    'офиске'
}

# foods = {
#     'аш',
#     'пицца',
#     'ачуу эт',
#     'пирожок',
#     'лагман',
#     'мясной рулет',
#     'ташкентский аш',
#     'тибон',
# }


# start = input('Баштоо учун "start" деп жазыныз: ')
# # Наугад кайсыл жерде отурабыз жана кандай тамак жейбиз чыгарып бериш керек.

# mesto1 = mesto.pop()
# foods1 = foods.pop()

# if start == start:
#     print('Биз келе жаткан суббота коллектив менен', mesto1, 'барабыз жана', foods1, 'жейбиз.')

root.mainloop()

